#CODING:UTF-8
import os
print("""小明带两个妹妹参加元宵灯会。别人问她们多大了，她们调皮地说：“我们俩的年龄之积是年龄之和的 6 倍”。
小明又补充说：“她们可不是双胞胎，年龄差肯定也不超过 8 岁啊。“ 请你写出：小明的较小的妹妹的年龄。""")
print("="*20)
for i in range(1,100):
    for j in range(1,i):
        if i*j == 6*(i+j) and i-j<8:
            print(i,j)
print("""美国数学家维纳(N.Wiener)智力早熟，11 岁就上了大学。他曾在 1935~1936 年应邀来中国清华大学讲学。

一次，他参加某个重要会议，年轻的脸孔引人注目。

于是有人询问他的年龄，他回答说：

“我年龄的立方是个 4 位数。我年龄的 4 次方是个 6 位数。这 10 个数字正好包含了从 0 到 9 这 10 个数字，每个都恰好出现 1 次。“

请你推算一下，他当时到底有多年轻?
————————————————
版权声明：本文为CSDN博主「大靠山」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
原文链接：https://blog.csdn.net/m0_59235245/article/details/131185493
""")
print("="*20)
for i in range(10,30):
    i3 = str(i ** 3)
    i4 = str(i ** 4)
    if len(i3) == 4 and len(i4) == 6:
        if len(set(i3+i4)) == 10:
            print(i)
            print(i3 + i4)
os.system("pause")
